{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.2.2.1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of32.bin", "group1-shard2of32.bin", "group1-shard3of32.bin", "group1-shard4of32.bin", "group1-shard5of32.bin", "group1-shard6of32.bin", "group1-shard7of32.bin", "group1-shard8of32.bin", "group1-shard9of32.bin", "group1-shard10of32.bin", "group1-shard11of32.bin", "group1-shard12of32.bin", "group1-shard13of32.bin", "group1-shard14of32.bin", "group1-shard15of32.bin", "group1-shard16of32.bin", "group1-shard17of32.bin", "group1-shard18of32.bin", "group1-shard19of32.bin", "group1-shard20of32.bin", "group1-shard21of32.bin", "group1-shard22of32.bin", "group1-shard23of32.bin", "group1-shard24of32.bin", "group1-shard25of32.bin", "group1-shard26of32.bin", "group1-shard27of32.bin", "group1-shard28of32.bin", "group1-shard29of32.bin", "group1-shard30of32.bin", "group1-shard31of32.bin", "group1-shard32of32.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_8/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_9/kernel", "shape": [3, 3, 512, 1024], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_10/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "conv2d_10/bias", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_10/gamma", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [1024], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [1024], "dtype": "float32"}, {"name": "conv2d_11/kernel", "shape": [2, 2, 1024, 512], "dtype": "float32"}, {"name": "conv2d_11/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_12/kernel", "shape": [3, 3, 1024, 512], "dtype": "float32"}, {"name": "conv2d_12/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_11/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_13/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "conv2d_13/bias", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/gamma", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "conv2d_14/kernel", "shape": [2, 2, 512, 512], "dtype": "float32"}, {"name": "conv2d_14/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_15/kernel", "shape": [3, 3, 768, 256], "dtype": "float32"}, {"name": "conv2d_15/bias", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_16/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "conv2d_16/bias", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "conv2d_17/kernel", "shape": [2, 2, 256, 512], "dtype": "float32"}, {"name": "conv2d_17/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_18/kernel", "shape": [3, 3, 640, 128], "dtype": "float32"}, {"name": "conv2d_18/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_15/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_19/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_19/bias", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_16/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_16/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_16/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_16/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "conv2d_20/kernel", "shape": [2, 2, 128, 512], "dtype": "float32"}, {"name": "conv2d_20/bias", "shape": [512], "dtype": "float32"}, {"name": "conv2d_21/kernel", "shape": [3, 3, 576, 64], "dtype": "float32"}, {"name": "conv2d_21/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_17/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_17/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_17/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_17/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_22/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_22/bias", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_18/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_18/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_18/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_18/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_23/kernel", "shape": [3, 3, 64, 2], "dtype": "float32"}, {"name": "conv2d_23/bias", "shape": [2], "dtype": "float32"}, {"name": "conv2d_24/kernel", "shape": [1, 1, 2, 1], "dtype": "float32"}, {"name": "conv2d_24/bias", "shape": [1], "dtype": "float32"}]}]}